# Библиотека pandas основы

In [39]:
import pandas as pd 
url = 'https://raw.githubusercontent.com/Sketchjar/MachineLearningHD/main/bank_marketing_dataset.csv'
dataFrame=pd.read_csv(url)
dataFrame.info()

#dataFrame.describe() #Описание датафрейма
#pd.DataFrame(dataFrame['previous']) #Создание датафрейма из серии 
#dataFrame.loc[dataFrame['age']==35].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41188 non-null  int64
 1   job             41188 non-null  object
 2   marital         41188 non-null  object
 3   education       41188 non-null  object
 4   default         41188 non-null  object
 5   housing         41188 non-null  object
 6   loan            41188 non-null  object
 7   contact         41188 non-null  object
 8   month           41188 non-null  object
 9   day_of_week     41188 non-null  object
 10  duration        41188 non-null  int64
 11  campaign        41188 non-null  int64
 12  pdays           41188 non-null  int64
 13  previous        41188 non-null  int64
 14  poutcome        41188 non-null  object
 15  emp.var.rate    41188 non-null  float64
 16  cons.price.idx  41188 non-null  float64
 17  cons.conf.idx   41188 non-null  float64
 18  euribor3m       41188 non-null  float64
 19  nr.employed     41188 non-null  float64
 20  outcome         41188 non-null  object
dtypes: float64(5), int64(5), object(11)
memory usage: 6.6+ MB

# Агрегация

In [ ]:
dataFrame.groupby('job')['age'].mean()

##Применение нескольки функций для колонки

In [43]:
dataFrame['age'].agg(['count','mean','median','max'])

count     41188.00000
mean         40.02406
median       38.00000
max          98.00000
Name: age, dtype: float64

In [47]:
dataFrame.agg(
    {
    'age':['count','mean','median'],
    'month':['max']
    }
           )

                age month
count   41188.00000   NaN
mean       40.02406   NaN
median     38.00000   NaN
max             NaN   sep

In [50]:
users=pd.read_csv('student.csv')
users.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [53]:
users['class1']='business class'

In [54]:
users.head()

   id        name           class  mark  gender          class1
0   1    John Deo  business class    75  female  business class
1   2    Max Ruin  business class    85    male  business class
2   3      Arnold  business class    55    male  business class
3   4  Krish Star  business class    60  female  business class
4   5   John Mike  business class    60  female  business class

In [57]:
def sorter(mark):
    if(mark>50):
        return 'High'
    else:
        return 'Low'
    
users['sort']=users['mark'].apply(sorter)
users.head()

   id        name           class  mark  gender          class1  sort
0   1    John Deo  business class    75  female  business class  High
1   2    Max Ruin  business class    85    male  business class  High
2   3      Arnold  business class    55    male  business class  High
3   4  Krish Star  business class    60  female  business class  High
4   5   John Mike  business class    60  female  business class  High

In [58]:
users.to_excel('users_info.xlsx')

ModuleNotFoundError: No module named 'openpyxl'